In [9]:
import pandas as pd
import numpy as np

In [10]:
data = pd.read_csv("data/chipotle.tsv", delimiter="\t")

data.head(10)

In [12]:
data.tail(10)

,order_id,quantity,item_name,choice_description,item_price
4612,1831,1,Carnitas Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$9.25
4613,1831,1,Chips,NaN,$2.15
4614,1831,1,Bottled Water,NaN,$1.50
4615,1832,1,Chicken Soft Tacos,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream]]",$8.75
4616,1832,1,Chips and Guacamole,NaN,$4.45
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [13]:
data.shape

(4622, 5)

In [14]:
data.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

## The item ordered the most

In [18]:
i = data.groupby('item_name').sum().sort_values(['quantity'],ascending = False).head(5)

/var/folders/0v/b3sl5vb16w106xkjbp23lzhw0000gp/T/ipykernel_64089/642842578.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  i = data.groupby('item_name').sum().sort_values(['quantity'],ascending = False).head(5)

In [19]:
i

                     order_id  quantity
item_name
Chicken Bowl           713926       761
Chicken Burrito        497303       591
Chips and Guacamole    449959       506
Steak Burrito          328437       386
Canned Soft Drink      304753       351

In [20]:
data.quantity.sum()

4972

## total revenue for each item

In [36]:
data['item_price'] = data['item_price'].replace({'\$': '', ',': ''}, regex=True).astype(float)

In [39]:
 k = data.groupby('item_name').sum().sort_values(['item_price'], ascending= False).head(5)

/var/folders/0v/b3sl5vb16w106xkjbp23lzhw0000gp/T/ipykernel_64089/2985680324.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  k = data.groupby('item_name').sum().sort_values(['item_price'], ascending= False).head(5)

In [40]:
k

                     order_id  quantity  item_price
item_name
Chicken Bowl           713926       761     7342.73
Chicken Burrito        497303       591     5575.82
Steak Burrito          328437       386     3851.43
Steak Bowl             193752       221     2260.19
Chips and Guacamole    449959       506     2201.04

### total number of orders placed

In [41]:
total_orders= data.quantity.sum()

In [42]:
total_orders

4972

## average revenue per order

In [49]:
avg_r_per_order = data.groupby('order_id').mean()

/var/folders/0v/b3sl5vb16w106xkjbp23lzhw0000gp/T/ipykernel_64089/2048299547.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  avg_r_per_order = data.groupby('order_id').mean()

In [50]:
avg_r_per_order

          quantity  item_price
order_id
1              1.0    2.890000
2              2.0   16.980000
3              1.0    6.335000
4              1.0   10.500000
5              1.0    6.850000
...            ...         ...
1830           1.0   11.500000
1831           1.0    4.300000
1832           1.0    6.600000
1833           1.0   11.750000
1834           1.0    9.583333

[1834 rows x 2 columns]

## total revenue

In [51]:
total_revenue = data.item_price.sum()
total_revenue

34500.16